---
kind: property
id: P:Autodesk.Revit.DB.Element.OwnerViewId
zh: 构件、图元、元素
source: html/174c1adf-0be8-a4b0-41f3-9e3ea1d6b1f1.htm
---
# Autodesk.Revit.DB.Element.OwnerViewId Property

**中文**: 构件、图元、元素

The id of the view that owns the element.

## Syntax (C#)
```csharp
public ElementId OwnerViewId { get; }
```